package syntax

//как добавить числа в массив
/*
val arr = mutableListOf<Int>()
for (i in 0..99){
    arr.add(i)
}
println(arr)
*/

//   как еще создать массив чисел
//   val numbers = (0..100).toList()




/*
Массивы - коллекция данных фиксированной длины
in java: type[] array = new type[10];
in kotlin: val ar = arrayOf(1,2,3)

В массиве можно указывать тип null.
В коллекциях нельзя менять данные.
Чтобы можно было изменять данные в массиве - нужно создавать mutable коллекцию:
var mas = mutableListOf()

Обращаться к элементам коллекции можно через квадратные скобки
mas[1]

Для быстрой инициализации коллекций нужно использовать методы listOf, setOf, mapOf
(если нужен изменяемая коллекция - добавляем приставку mutable)
 */