package Class_example

class Building (var floors: Int = 5, var length: Double = 6.0, var width: Int = 5){

/*конструктор класса используется только для того чтобы создать объект класса, он смотрит какие есть поля, методы
в этом классе и добавляет их в объект

Констуктор указывается сразу при объявлении класса и указываются входные параметры в круглых скобках после объявления
класса. См пример выше для этого класса

Чтобы создать дефолтные значения для параметров конструктора нужно после указания параметра поставить равно
 и указать значение. Например, var floors: Int = 5
 */



    fun build (a: Int, b: Float){

    }
}